#pragma once
#include "console/console.h"
#include <ctime> 
const int cWidth = 8;
const int cHeight = 6;
const int cCount = 4;
struct Suit {
    const char* f[cCount][cHeight] = {
   {//0 черви
       ".------.",
       "|#.--. |",
       "| (\\/) |",
       "| :\\/: |",
       "| '--'#|",
       "`------'"
   },
   {//1 крести
       ".------.",
       "|#.--. |",
       "| :(): |",
       "| ()() |",
       "| '--'#|",
       "`------'"
   },
   {//2 буби
       ".------.",
       "|#.--. |",
       "| :/\\: |",
       "| :\\/: |",
       "| '--'#|",
       "`------'"
   },
   {//3 пики
       ".------.",
       "|#.--. |",
       "| :/\\: |",
       "| (__) |",
       "| '--'#|",
       "`------'"
   }
    };
    const char* b[cHeight] = {
     ".------.",
     "|^ ^ ^ |",
     "| ^ ^ ^|",
     "|^ ^ ^ |",
     "| ^ ^ ^|",
     "`------'"
    };
};


struct Card {
    int suit;//Рубашка
    char cost;//Стоимость
    bool active = true;//Активность карты.false - карта уже отгадана
};

struct Board {
    Coordinate sPos;//Стартовая позиция поля
    Card* deck = nullptr;//Колода карт
    int cDeck;//Количество активных карт, когда дойдет до 0, игра пройдена
    int oc = -1;//Номер открытой карты
    time_t st;//Время начала игры
    Coordinate sel;//Позиция курсора
    int rows;//Количество рядов разложенных карт
    int cols;//Количество колонок разложенных карт
    int flips = 0;//Количество перевернутых карт
};